<!DOCTYPE html>
<html>
<head>
    <meta charset="utf-8">
    <title>Ваші логін і пароль для системи</title>
</head>
<body>
<p>На електронну пошту власника закладу, яку ви вказали у формі, ми надіслали логін та пароль від системи.
    Вхід потрібно здійсювати через систему eHealth" Не забудьте поставити галочку при вході!</p>
<p>Актуальну інформацію про статус реєстрації закладу відображається в акаунті власника закладу.</p>
<p><strong>Логін:</strong> {{ $email }}</p>
<p><a href="{{route('login')}}">Увійти</a></p>
</body>
</html>
