<?php

declare(strict_types=1);

return [
    'policy' => [
        'deny' => [
            'deactivate' => 'У вас немає дозволу на деактивацію цього місця надання послуг',
            'activate' => 'У вас немає дозволу на активацію цього місця надання послуг',
            'create' => 'У вас немає дозволу на створення місця надання послуг',
            'edit' => 'У вас немає дозволу на редагування цього місця надання послуг',
            'delete' => 'У вас немає дозволу на видалення чернетки цього місця надання послуг'
        ]
    ],

    // modal
    'modals' => [
        'activate' => [
            'title' => 'Підтвердження активації МНП',
            'confirmation_text' => 'Ви впевнені, що хочете активувати це МНП?',
        ],
        'deactivate' => [
            'title' => 'Підтвердження деактивації МНП',
            'confirmation_text' => 'Ви впевнені, що хочете деактивувати це МНП?',
        ],
        'delete' => [
            'title' => 'Підтвердження видалення чернетки',
            'confirmation_text' => 'Ви впевнені, що хочете видалити цю чернетку?',
        ],
    ],

    'request' => [
        'activated' => 'Місце надання послуг активовано',
        'deactivated' => 'Місце надання послуг деактивовано',
        'sync' => [
            'errors' => [
                'fail' => 'Помилка синхронізації. Зверніться до адміністратора.',
                'cannot_sync' => 'Синхронізація вже запущена або не дозволена'
            ]
        ]
    ],

    // draft
    'draft' => [
        'delete_success' => 'Чернетку успішно видалено.',
        'errors' => [
            'delete' => 'Цю чернетку місця надання послуг не вдалось видалити',
        ]
    ],

    'errors' => [
        'deactivate' => 'Це місце надання послуг не вдалось деактивувати',
        'activate' => 'Це місце надання послуг не вдалось активувати',
    ],

    'division_updated' => 'Дані місця надання послуг було оновлено',
];
